Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption
The option determines the slop of the sketched run/landing.
Since:
2015

Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption.Sloped
The slope of the sketched run/landing will be specified by users.

Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption.Flat
The slope of the sketched run/landing will be kept flat.

Autodesk.Revit.DB.Architecture.SketchedCurveSlopeOption.Auto
The slope of the sketched run/landing will be auto detected.